[{"Author": ["witchywoman"], "Instructions": "Mix grapefruit, orange, apples, pineapple, maraschino cherries, and grapes in a large bowl. Mash slightly with the back of a wooden spoon to release juices. Add bananas, coconut, walnuts, and sugar; stir to coat. Cover and refrigerate to blend flavors, at least 1 hour."}, {"Author": ["witchywoman"], "Instructions": "Fill a margarita glass with crushed ice. Pour tequila, melon liqueur, and triple sec into the glass. Top with sour mix, grenadine, lime juice, and orange juice. Garnish with the cherry and a wedge of orange."}, {"Author": ["witchywoman"], "Instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease 12 muffin cups or line with paper muffin liners. Stir the flour, cinnamon, nutmeg, allspice, cloves, pumpkin pie spice, cardamom, ginger, salt, and baking soda together in a bowl. Beat the brown sugar and the eggs together with an electric mixer in a large bowl until smooth. Add 1/2 cup plus 2 tablespoons vegetable oil and pumpkin; continue beating until integrated. Pour the flour mixture into the egg mixture and beat until just incorporated. Fill the prepared muffin cups about half-full with the batter. Spoon about 1 teaspoon cream cheese into the center of each muffin cup and poke it down into the middle of the batter with a finger. Sprinkle the sunflower seeds over each muffin. Bake in the preheated oven until golden and the tops spring back when lightly pressed, about 25 minutes. Let cool in pan 5 minutes and remove to a rack to cool completely. Be extra careful; the cream cheese stays hot for a while!"}, {"Author": ["witchywoman"], "Instructions": "   "}, {"Author": ["witchywoman"], "Instructions": "Mix the teriyaki sauce, garlic, ginger, and red pepper flakes in a bowl; stir in the chicken pieces until thoroughly coated. Cover the bowl and refrigerate the chicken 3 to 4 hours to overnight. Remove a piece of chicken from the marinade and place into the center of an aluminum square. Fold the square diagonally over the chicken piece in a triangle shape; fold up the open edges of the triangle several times and press tightly together to seal the chicken into the foil. Repeat with remaining chicken pieces. Discard the used marinade. Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Gently add the sealed foil packets to the hot oil and fry until the chicken is tender and cooked through, 2 to 4 minutes. Drain the packets on paper towels and allow to cool slightly. To serve, tear open the packets along the sealed edges."}, {"Author": ["witchywoman"], "Instructions": "Fill a pint glass with ice, and pour in the vodka, amaretto, peach schnapps, coconut rum, and melon liqueur; stir. Pour in the orange juice and pineapple juice. Float the cranberry juice on top. Garnish with a lemon twist."}, {"Author": ["witchywoman"], "Instructions": "Stir the salad shrimp, tomatoes, onion, cilantro, lime juice, salt, pepper, and garlic together in a large glass bowl. Cover with plastic wrap and refrigerate until the flavors combine, at least 1 hour. Serve cold."}, {"Author": ["witchywoman"], "Instructions": "Combine butter, brown sugar, and confectioners' sugar in a large coffee mug; stir the mixture together with a fork until well combined. Pour in the rum, add the ice cream and cinnamon, and fill the remainder of the mug with simmering water. Mix the drink with the fork until the ice cream and butter have melted together to make a creamy topping. Sprinkle with a dash of nutmeg, and serve."}, {"Author": ["witchywoman"], "Instructions": "Beat the mascarpone cheese, sugar, vanilla extract, and egg yolk in a bowl until lightly and creamy. Cut the sponge snack cakes in half lengthwise, then in half widthwise, cutting each into 4 pieces. Press two cake pieces into the bottom of a large coffee mug, cream-side-down. Press four cake pieces around the inside of the mug. Repeat with a second mug. Sprinkle the sponge cake with 2 tablespoons of coffee liqueur per mug. Spoon in half of the mascarpone mixture and place two more sponge cake halves on top, cream-side-down. Sprinkle the tops with the remaining coffee liqueur. Wrap with plastic wrap, and refrigerate at least 2 hours before serving."}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["Chef John"], "Instructions": "Place cream cheese, fromage blanc, tomato paste, cider vinegar, Worcestershire sauce, onion, and garlic powder in a bowl. Add sriracha sauce, ghost pepper sauce, sweet and hot paprika, chipotle powder, and cayenne pepper. Stir until well combined and the cheeses are completely blended in. Cover bowl with plastic wrap and refrigerate about 3 hours or, ideally, overnight. Season with salt, if desired. Transfer to a serving bowl."}, {"Author": ["Chef John"], "Instructions": "Cut small, shallow X on the bottom of each tomato. Remove any stems. Place some ice cubes in a bowl of water. Bring a pot of water to a boil over medium-high heat. Add tomatoes and stir them gently until skin begins to peel back from Xs, about 10 to 20 seconds. Immediately transfer tomatoes to ice water with a slotted spoon. Gently peel off skins and place \"naked\" tomatoes in a bowl. Place mint leaves in a small bowl. Add vinegar, olive oil, cayenne pepper, salt and pepper. Mix until well blended, bruising the mint leaves to release the flavor. Drizzle over tomatoes. Cover and refrigerate until thoroughly chilled, 30 to 60 minutes. About halfway through chilling, gently stir to coat tomatoes in dressing. Drizzle with a few drops of sherry vinegar and olive oil, if desired. Serve drizzled with dressing and a sprinkle of sea salt."}, {"Author": ["Chef John"], "Instructions": "Place potatoes in a large pot with water. Bruise the rosemary with the dull side of a knife blade and place in the pot. Add garlic, bay leaves, and salt. Bring to a boil; simmer for 5 minutes. Drain; let potatoes air dry. Preheat oven to 375 degrees F (190 degrees C). When potatoes are thoroughly dry, transfer them back to the pot. Drizzle with olive oil, cayenne pepper, and a pinch of salt. Stir to coat. Transfer potatoes to a rimmed sheet pan. Bake until potatoes are golden brown and crusty, and the flesh is creamy and soft, about 35 to 45 minutes, depending on the size of the potatoes."}, {"Author": ["Chef John"], "Instructions": "Stir cabbage, Thousand Island dressing, rice vinegar, hot sauce, and salt together in a bowl with a fork until evenly mixed."}, {"Author": ["Chef John"], "Instructions": "Whisk together ground coffee and cold water in a small bowl. Cover with plastic wrap and set aside for 12 hours. Whisk, then strain through a funnel lined with a moistened paper towel into a bowl. Place ice cream scoops in 2 coffee or espresso cups. Pour 1/4 to 1/2 cup cold coffee over the top of each. Garnish with shaved dark chocolate."}, {"Author": ["Chef John"], "Instructions": "Mix mayonnaise, vinegar, horseradish, lemon juice, black pepper, mustard, salt, cayenne pepper, and garlic powder together in a bowl. Whisk together thoroughly until creamy and smooth. Cover and refrigerate until ready to use."}, {"Author": ["Chef John"], "Instructions": "Place half the ground beef on a sheet of plastic wrap. Pat it into a rectangular shape, about 1/2 inch thick, 8 1/2 inches long, and 4 inches wide. Season with salt and pepper. Roll the beef into a log, using the plastic wrap as a guide. Season with more salt and pepper. Wrap the plastic tightly around the log and twist both ends tight. Pat gently to slightly flatten. Repeat with remaining ground beef. Preheat an outdoor grill for medium-high heat and lightly oil the grate. Remove the burger dogs from the plastic wrap and place on the grill, perpendicular to the grates. Cook until burgers are browned but still pink inside, 4 to 5 minutes, flip, and cook another 2 to 3 minutes. Place a slice of cheese on each burger dog and grill to medium doneness (an instant-read thermometer inserted into the center should read at least 140 degrees F/60 degrees C). Remove and rest 3 to 4 minutes. Toast hot dog buns on the grill and spread each with 2 teaspoons mayonnaise. Place burger dog on each bun and squirt 1 tablespoon of ketchup on top."}, {"Author": ["Chef John"], "Instructions": "Combine chopped almonds and parsley on a cutting board; chop together again until very finely chopped. Transfer almond mixture to a bowl and add garlic. Stir olive oil into almond mixture until a thick sauce forms."}, {"Author": ["Chef John"], "Instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with a silicon mat or parchment paper. Mash the butter, white sugar, and brown sugar together in a large mixing bowl with a spatula until creamy and smooth, 2 to 3 minutes. Add the egg and vanilla; whisk vigorously for 20 to 30 seconds. Whisk the flour, salt, and baking soda together in a small bowl; dump into the butter mixture and mix until just combined. Fold the semi-sweet chocolate chips, white chocolate chips, and milk chocolate chips into the mixture. Arrange onto the prepared baking sheet using a small scoop or large spoon. Bake in the preheated oven until golden brown, about 10 minutes; remove from oven and allow to cool on the sheet for 10 minutes. Transfer to a wire rack to finish cooling completely."}, {"Author": ["Chef John"], "Instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and rinse with cold water until cool enough to handle. Peel potatoes and cut into 1/2-inch cubes. Heat oil in a skillet over medium heat. Cook and stir white and light green onion pieces until soft and slightly golden, 3 to 5 minutes. Add garlic, stir, and remove skillet from heat. Stir potatoes, green onion-garlic mixture, dark green onion pieces, yogurt, yellow mustard, cayenne pepper, salt, and black pepper together in a bowl until evenly combined."}, {"Author": ["bellepepper"], "Instructions": "Combine orzo, wild rice, orange bell pepper, red bell pepper, corn, currants, and red onion together in a large bowl. Blend vegetable oil, sugar, white wine vinegar, cider vinegar, minced onion, white pepper, paprika, garlic powder, and 1 pinch salt together in a blender or food processor until smooth. Mix pecans, almonds, and parsley into orzo mixture. Drizzle enough dressing to coat salad; toss to evenly coat. Season with salt and black pepper."}, {"Author": ["bellepepper"], "Instructions": "Preheat oven to 400 degrees F (200 degrees C). Spray a 9x13-inch baking pan or cast iron skillet with cooking spray; pour in about 1 teaspoon vegetable oil to coat the bottom. Mix Parmesan cheese, salt, garlic powder, paprika, and black pepper together in a bowl. Blot the cut-side of potatoes with a paper towel to remove any moisture. Place potatoes in a bowl and drizzle with 1 tablespoon vegetable oil; toss until potatoes are lightly coated. Sprinkle potatoes with Parmesan cheese mixture; toss to coat. Arrange potatoes, cut-side down, onto the prepared baking pan. Bake in the preheated oven for 15 to 20 minutes. Turn potatoes to cut-side up; continue baking until golden and crispy, about 15 to 20 more minutes. Serve with sour cream."}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["TheBritishBaker"], "Instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease 2 large baking sheets. Combine water, mashed bananas, honey, vanilla, and egg in a large bowl. Stir in whole-wheat flour and baking powder. Beat dough with an electric mixer on medium speed until ingredients are thoroughly combined, 1 to 2 minutes. Turn dough onto a floured surface and knead until no longer sticky, 5 to 8 minutes. Roll out dough to 1/4-inch thickness and cut into mini shapes with your favorite cookie cutter. Place dough shapes on prepared baking sheets. Bake in preheated oven until cookies are lightly browned, about 20 minutes. Turn off the oven and leave cookies until thoroughly dry and crisp, 30 to 40 more minutes. Remove baking sheets from oven and allow cookies to cool on pans for 10 minutes. Transfer cookies to wire rack to fully cool."}, {"Author": ["TheBritishBaker"], "Instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease baking sheets, or line them with parchment paper. In a large bowl, whisk the whole wheat flour and baking powder together until thoroughly combined, and stir in the cooked turkey meat and dried cranberries. Make a well in the center of the flour mixture, and drop the egg into the center; pour in the olive oil and about 1/2 cup of chicken broth. Mix into a soft dough. If mixture is too dry, mix in more chicken broth, about 1 tablespoon at a time, until dough is of desired consistency. Turn the dough out onto a floured work surface, and knead for 1 to 2 minutes. Roll the dough out 1/4 inch thick, and cut out with your favorite cookie cutters. Bake until the treats turn brown, about 25 minutes. Turn the oven off, and leave the dog treats in the oven an additional 30 minutes to dry out. Refrigerate leftover dog treats."}, {"Author": ["TheBritishBaker"], "Instructions": "Preheat an oven to 400 degrees F (200 degrees C). Lightly grease 2 large baking sheets. Mix the whole wheat flour, cornmeal, rolled oats, and baking powder together in a bowl. Lightly mix the water, applesauce, and vanilla extract into the flour mixture. Stir the eggs and peanut butter into the mixture. Turn the dough onto a floured surface and knead until no longer sticky, about 1 minute. Roll out the dough to 1/4-inch thickness; cut into 75 small squares and arrange onto baking sheets. Bake in the preheated oven for 15 minutes. Turn the oven off and allow the treats to sit in the oven as it cools another 30 minutes. Remove the treats from the oven; allow the treats to cool on the baking sheets for 10 minutes before removing to a wire rack to cool completely."}, {"Author": ["TheBritishBaker"], "Instructions": "Stir milk, schnapps, Irish cream liqueur, vodka, and coffee-flavored liqueur together in a bowl. Add pudding mix and blend thoroughly. Spoon into disposable shot cups and refrigerate until chilled, at least 30 minutes."}, {"Author": ["TheBritishBaker"], "Instructions": "Stir milk, vodka, and pudding mix together in a bowl until mixture thickens. Fold in whipped topping. Spoon into disposable shot cups and refrigerate until chilled, at least 30 minutes."}, {"Author": ["TheBritishBaker"], "Instructions": "Combine coriander, cumin, garlic powder, ginger, cloves, mace, fenugreek, cinnamon, black pepper, cardamom, and nutmeg together in a bowl; store in an airtight container."}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["LoveMexiFood"], "Instructions": "Place the avocados into a mixing bowl; mash with a fork. Mix in cream cheese, cottage cheese, onion, chili peppers, and salsa. Season with garlic salt, lemon juice, and salt and pepper."}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["Peach822"], "Instructions": "Heat the vegetable oil in a skillet over medium heat, and brown the ribs on all sides. Transfer to a slow cooker. Place onion in the skillet, cook until tender, and transfer to the slow cooker. Place the chicken in the slow cooker, and mix in tomatoes, ketchup, steak sauce, cider vinegar, Worcestershire sauce, hot sauce, lemon, chicken bouillon, and pepper. Cover, and cook 6 hours on High. Remove ribs, discard bones, and shred. Return meat to slow cooker. Mix in corn and lima beans, cover, and continue cooking 2 hours on High."}, {"Author": ["Peach822"], "Instructions": "Bring a large pot of lightly salted water to a boil. Add the macaroni, and cook until tender, about 8 minutes. Drain and rinse under cold running water. In a large bowl, stir together the macaroni, tuna, celery, onion and peas. Mix in the mayonnaise, relish, salt and pepper. Garnish with egg wedges and a sprinkle of paprika. Cover and chill for at least 1 hour before serving."}, {"Author": ["Peach822"], "Instructions": "Combine red wine vinegar, water, vegetable oil, olive oil, lemon juice, Worcestershire sauce, garlic, salt, pepper, sugar, and mustard together in a bowl until dressing is smooth. Place chopped lettuce and watercress in a large salad bowl. Arrange tomatoes, turkey, eggs, blue cheese, bacon, and avocados on top. Add desired amount of dressing before serving and toss."}, {"Author": ["Peach822"], "Instructions": "Place the cranberries into a food processor, and pulse until finely chopped. They should still have some texture. Transfer to a serving bowl, and stir in the sugar, orange liqueur, cucumber, celery and jalapeno. Let sit at room temperature for 15 minutes before serving to blend the flavors."}, {"Author": ["Peach822"], "Instructions": "Place the bouillon cubes in a medium pot filled with water, and bring to a boil. Place orzo in the pot when bouillon has dissolved, and cook 8 minutes, until al dente. Drain. Transfer orzo to a large bowl, and toss with roasted red peppers, kalamata olives, artichoke hearts, and Parmesan."}, {"Author": ["Peach822"], "Instructions": "In a bowl, mix together the tomatoes, the 1/3 cup chopped onion, 2 of the 4 cloves of minced garlic, serrano chile pepper, lime juice, and cilantro. Stir in salt and pepper to taste, and set aside. Place the ground turkey in a bowl. Add the egg, the 1/2 onion, minced, remaining 2 cloves minced garlic, coriander, celery salt, chili powder, cumin, and chopped parsley. Using your hands, work the mixture until all ingredients are evenly blended. Form mixture into 4 patties. Heat a large, non-stick skillet for medium-high heat. Cook the turkey burgers for 5 minutes per side, or until no longer pink in the center and juices run clear. Reduce the heat as necessary during cooking. Serve with Pico de Gallo salsa."}, {"Author": ["Peach822"], "Instructions": "Spread the lettuce out on a large serving dish or bowl. Sprinkle the onion, celery, water chestnuts and frozen peas (unthawed) over the lettuce in layers. Spread mayonnaise over the top like a frosting. Sprinkle with sugar and grated cheese. Cover and refrigerate overnight. Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble and set aside. Before serving, sprinkle crumbled bacon over the top, and garnish with tomato wedges, slices of hard-cooked egg, and parsley."}, {"Author": ["Peach822"], "Instructions": "Preheat the oven to 350 degrees F (175 degrees C). If you are not using a nonstick muffin pan, grease 5 cups of a regular muffin pan. In a medium bowl, stir together the flour, milk, and mayonnaise. Spoon into the 5 prepared muffin cups. Bake for 15 minutes in the preheated oven, or until nicely puffed and browned."}, {"Author": ["Peach822"], "Instructions": "Place potatoes in pressure cooker with water. Cook on high pressure 3 minutes. If potatoes are larger, cook for 4 minutes. Let steam release for 3 minutes. Then quickly release pressure and open cooker. Peel and dice potatoes when they are cool enough to handle. Alternate layers of potatoes, onion, and celery in a large bowl. Season each layer with salt and pepper. Top with the chopped egg and sprinkle with dill. Mix together the mayonnaise, mustard, and cider vinegar in a small bowl. Gently fold the mayonnaise mixture into the potatoes. Chill at least one hour before serving."}, {"Author": ["Peach822"], "Instructions": "Heat a large pot over medium-high heat and stir in the sausage. Cook and stir until sausage is crumbly, evenly browned, and no longer pink, about 5 minutes. Drain and discard any excess grease. Stir onion and red bell pepper into sausage; cook and stir until vegetables begin to soften, about 3 minutes. Pour water into the pot; add Swiss chard, chicken bouillon, garlic salt, and Italian seasoning. Cover and reduce heat to medium-low; Simmer until vegetables are very tender, about 20 minutes. Sprinkle soup with Parmesan cheese before serving."}, {"Author": ["Litegal1"], "Instructions": "Preheat an oven to 500 degrees F (260 degrees C). Place the bell peppers onto a baking sheet. Roast in the preheated oven until the skins are nicely blackened, about 30 minutes. Turn the peppers once halfway through to ensure even cooking. Once blackened, place the peppers into a bowl, cover with foil, and allow to steam 20 to 30 minutes. Meanwhile, whisk together the olive oil, vinegar, salt, pepper, garlic, and capers in a bowl; set aside. Once the peppers have finished steaming, remove and discard the stems, skins, and seeds. Cut the peppers into quarters and stir into the vinaigrette. Cover with plastic wrap and refrigerate at least 30 minutes before serving."}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["Semigourmet"], "Instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate. Whisk garlic, olive oil, rosemary, mustard, lemon juice, ground black pepper, and salt together in a bowl. Place chicken breasts in a resealable plastic bag. Pour garlic mixture over chicken, reserving 1/8 cup. Seal bag and massage marinade into chicken. Let stand for 30 minutes at room temperature. Place chicken on preheated grill and cook for 4 minutes. Turn the chicken, baste with reserved marinade, and continue to grill until cooked through, about 5 minutes. Cover with foil and let rest for at least 2 minutes before serving."}, {"Author": ["Semigourmet"], "Instructions": "Preheat oven to 400 degrees F (200 degrees C). Cut each potato into 4 thick slices, stopping before you cut through the bottom. Drizzle butter over slices; season with salt and pepper. Sprinkle 1 teaspoon bacon bits between the slices. Wrap potatoes in aluminum foil; transfer to a rimmed baking sheet. Bake in the preheated oven until tender, 45 to 60 minutes. Garnish potatoes with sour cream, Cheddar cheese, and chives."}, {"Author": ["Semigourmet"], "Instructions": "Preheat oven to 425 degrees F (220 degrees C). Spray a 3-quart casserole dish with cooking spray. Combine tomato sauce with chili powder and 1/2 cup water or as desired in a small saucepan over medium heat; bring to a simmer and stir to make a pourable sauce. Remove from heat and set enchilada sauce aside. Cook and stir ground turkey, onion, and 1 envelope of taco seasoning mix in a large skillet over medium heat, chopping turkey as you cook, until meat is crumbly and no longer pink, about 10 minutes. Stir in 2/3 cup water and remaining envelope of taco seasoning mix and cook, stirring often, until moisture has evaporated from turkey mixture. Mix 1 cup of enchilada sauce into turkey mixture and remove skillet from heat. To layer the casserole, spread 8 tortilla halves into the bottom of the prepared baking dish, overlapping as necessary to fit. Toss sharp Cheddar cheese and Monterey Jack cheese together in a bowl and spread 1/4 of the cheese mixture over the tortillas in an even layer. Top with 1/3 the turkey mixture, 1/3 the lettuce, 1/3 the chopped tomatoes, and about 1/3 cup of the remaining sauce. Repeat layers twice more. Place 8 tortilla halves on top of the casserole and spread with remaining 1 1/4 cup shredded cheese mixture. Bake in the preheated oven until cheese on top of casserole is melted and browned, 20 to 30 minutes."}, {"Author": ["Semigourmet"], "Instructions": "Heat the olive oil in a skillet over medium heat; cook the onion and bell pepper in the hot oil until they begin to soften, about 5 minutes. Add the garlic and ground turkey to the skillet; cook and stir until the turkey is completely crumbled and browned, another 5 to 7 minutes. Stir the pureed tomatoes, barbeque sauce, ketchup, vinegar, Worcestershire sauce, mustard, and chile-garlic sauce into the turkey mixture. Simmer until completely heated, 7 to 10 minutes more."}, {"Author": ["Semigourmet"], "Instructions": "Stir celery flakes, salt, paprika, garlic powder, onion powder, thyme, sage, black pepper, rosemary, and cayenne pepper together in a bowl. Transfer spice mixture to a spice grinder or food processor and blend until smooth."}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["ellie"], "Instructions": "Preheat oven to 400 degrees F (200 degrees C). Mix chickpeas, nutritional yeast, olive oil, chili powder, onion powder, and salt together in a bowl until combined. Spread evenly on a rimmed baking sheet. Bake in the preheated oven, shaking the pan occasionally to re-distribute chickpeas, until crispy, 30 to 40 minutes."}, {"Author": ["ellie"], "Instructions": "Combine popcorn kernels and oil in a deep pot over high heat and place a cover on the pot. Cook the popcorn, frequently shaking the pot to move the kernels, until the sound of kernels popping slows to nearly a stop, about 7 minutes. Carefully pour popcorn into a large mixing bowl. Sprinkle lime zest and salt over the popcorn. Whisk lime juice, melted butter, and sriracha sauce together in a bowl; drizzle over popcorn and toss to coat."}, {"Author": ["ellie"], "Instructions": "Combine hot chocolate Irish cream liqueur, and creme de cacao in a coffee glass or mug."}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["witchywoman"], "Instructions": "Mix the teriyaki sauce, garlic, ginger, and red pepper flakes in a bowl; stir in the chicken pieces until thoroughly coated. Cover the bowl and refrigerate the chicken 3 to 4 hours to overnight. Remove a piece of chicken from the marinade and place into the center of an aluminum square. Fold the square diagonally over the chicken piece in a triangle shape; fold up the open edges of the triangle several times and press tightly together to seal the chicken into the foil. Repeat with remaining chicken pieces. Discard the used marinade. Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Gently add the sealed foil packets to the hot oil and fry until the chicken is tender and cooked through, 2 to 4 minutes. Drain the packets on paper towels and allow to cool slightly. To serve, tear open the packets along the sealed edges."}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["Johanna WISHES she were a"], "Instructions": "Preheat oven to 350 degrees F (175 degrees C). Place squash into a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 10 minutes. Drain and mash squash in a bowl. Stir 1 cup corn flakes, margarine, eggs, sugar, seasoned salt, and black pepper into mashed squash. Transfer mixture to a 2-quart casserole dish. Sprinkle about 1/4 cup cornflake crumbs over squash mixture. Bake in the preheated oven until bubbling and topping is lightly browned, 20 to 25 minutes."}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["Semigourmet"], "Instructions": "Divide lettuce, or cabbage, chicken and among 4 bowls. Top each with 2 tablespoons ranch dressing, and 1 ½ tablespoons barbecue sauce, sprinkle each with 1 to 2 tablespoons bacon bits or to taste."}, {"Author": ["Semigourmet"], "Instructions": "Preheat the oven to 375 degrees. Mix mustard, honey, Agave nectar and sriracha; reserving 4 to 5 tablespoons. Lay chicken thighs in a single layer in greased 8x12” baking dish, sprayed with cooking spray. Pour remaining mustard mixture over chicken. Bake for 25 to 30 minutes, or until cooked through. Serve with reserved sauce drizzled over chicken."}, {"Author": ["Semigourmet"], "Instructions": "Cook pasta according to package directions. Sauté onions, mushrooms and garlic in 1 tablespoon of the butter until soft. Remove the onions, mushrooms and garlic and set them aside until later. In the same pan, cook the chicken, stirring frequently. Remove the chicken and it aside until later. To the same pan, add 2 Tbsp butter and melt over a low-medium heat. Sprinkle the flour over the butter and stir to make a roux. Slowly add in the madeira, sherry, and heavy cream, stirring constantly. Cook over a medium-high heat until thickened – Stirring often to keep it from sticking to the bottom of the pan. Add the parsley and let simmer for a few minutes. Add the chicken, mushrooms, garlic and onions back in and simmer for 2 more minutes. Pour over the pasta and server with Parmesan cheese."}, {"Author": ["Semigourmet"], "Instructions": "1. In a 1 gallon baggie add 1 or both tenderloins. cover with Marinade seal and place in the refrigerator overnight, turning once in a while. 2. when ready to grill; remove the meat from the refrigerator, take of of marinade discard marinade. place meat in a microwave safe dish and microwave for 3 minutes. then put straight onto a preheated grill at medium heat. cook 15 to 20 minutes or until at least 145 degrees internal temp. 3. remove from grill cover and let rest for 5 to 10 minutes. Then slice and serve."}, {"Author": ["Semigourmet"], "Instructions": "1. Heat oil in a large nonstick skillet over medium heat. Add the onion and next 4 ingredients (onion through garlic); sauté 4 minutes or until the onion is tender. Stir in chicken and orange juice; bring to a boil. Cook for 2 minutes or until the liquid is almost evaporated, stirring constantly. Add 1 can broth; bring to a boil. Stir in the bell pepper, carrot, Anaheim chile, jalapeño, and salt. Cook over medium heat 15 minutes or until vegetables are tender. Set aside. 2. Combine remaining 3 cans broth, cabbage, vegetable juice, rice, 1 tablespoon chili powder, and tomatoes in a large Dutch oven; bring to a boil. Reduce heat, and simmer 20 minutes. Add chicken mixture and beans; cook an additional 45 minutes. Serve with sour cream."}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["witchywoman"], "Instructions": "Roast the salt and peppercorns in a dry skillet over medium low heat until salt starts to turn yellow and the peppercorns get fragrant and peppercorns begin to pop open like popcorn does. In the meantime, preheat an outdoor grill to medium-high heat. Brush the chicken wings with peanut oil and grill the chicken wings over indirect heat until the juices run clear and the wings reach 165 degrees on an instant read thermometer. Place the salt and pepper blend in a mortar and grind with a pestle until everything is coarsely ground. Place the grilled chicken wings in a large bowl, sprinkle in 2 teaspoons, or more depending on taste, of the spice blend and toss to coat."}, {"Author": ["Litegal1"], "Instructions": "MIX all ingredients in a large bowl, except bread and extra virgin olive oil. COAT a large non-stick baking pan with pan spray; fill pan with mixture. Bake at 325F for about 25 minutes or until bubbling and center is hot. DRIZZLE both sides of bread with extra virgin olive oil. Grill bread on both sides. SPRINKLE top of heated dip with Parmesan cheese. Serve hot with grilled bread"}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["Litegal1"], "Instructions": "Use left over chicken breasts or prepare as follows: Place the chicken, 1 1/2 tablespoons of cilantro, and vegetable oil in a skillet over medium heat, and pan-fry the chicken breasts until lightly golden brown, no longer pink in the middle, and the juices run clear, about 5 minutes per side. Remove the chicken and set aside. When cooled, cut into cubes. Cook refried beans into the skillet until the beans are hot and bubbling, 5 to 10 minutes. Mix the taco seasoning and sour cream together in a bowl. To assemble, spread the hot bean and bacon mixture into the bottom of an 8x8-inch glass dish. Sprinkle the chicken cubes over the bean mixture, then follow with these layers: 3/4 cup of Cheddar cheese, guacamole, sour cream mixture, and sliced tomatoes. Sprinkle the top with 1 1/2 tablespoons of cilantro, black olives, green onions, and 1/4 cup of shredded cheddar cheese."}, {"Author": ["Litegal1"], "Instructions": "Combine all in non reactive bowl. Stir until sugar and salt have dissolved. Refrigerate a minimum of 2 days before eating. If using a bowl, place a small plate on top to keep carrots submerged."}, {"Author": ["Litegal1"], "Instructions": "Preheat oven to 400 Combine Chipolte Adobo sauce with olive oil and liberally brush on chicken. Season with salt and pepper. In oven proof skillet, sear chicken until nicely browned. Transfer to oven and cook 10 to 15 minutes more or until internal temp of 165 reached. Remove from oven, let cool, and cube or shred, which ever is ascetically pleasing to your eye. *Optional: I added a little chicken stock to the pan drippings, reduced a bit, and added that to the chicken. In a bowl, add cooked and cubed chicken (along with drippings if using). Stir in olives, onion, and tomatoes. Add lemon juice and feta cheese. Note: if not using drippings, add an additional tablespoon of olive oil if desired. Line a bowl or plate with lettuce and pile chicken mixture on top. Serve."}, {"Author": ["Litegal1"], "Instructions": "Dice broccoli into bite sized pieces and set aside. Heat 2T olive oil over medium high heat until hot, but not smoking. Fry 2 bread slices, apx 2 minutes per side, until golden brown. Repeat with remaining 2 slices and adt'l 2 T of oil if needed. Sprinkle tops of fried bread with some of the cheese and garlic powder if using. Set aside. Add remaining T of oil to pan. Add broccoli and saute briefly until just cooked, apx 2 to 3 minutes. Add garlic, anchovy paste or anchovies, and crushed red chili flakes. Continue to cook for about 30 seconds or until fragrant. Turn off heat and add lemon zest and juice if using. Salt to taste (you won't need much). Spoon broccoli mixture over tops of bread and sprinkle remaining cheese on top. Serve immediately."}, {"Author": ["Litegal1"], "Instructions": "Season flour with salt and pepper and set aside on plate Have beaten egg whites in a bowl and the breadcrumbs on a 3rd plate Line a baking sheet with parchment paper and line a rack with paper towels for draining Dredge eggplant (no need to salt or peel) in flour, then egg whites, and lastly in breadcrumbs. Oh. A note. Adding Parmesan cheese to breadcrumbs would be wonderful if you have it. If not, don't worry. Heat olive oil in large frying pan and saute breaded eggplant slices 1 to 2 minutes per side or until golden brown. Remove from oil and drain on paper towels. Once drained, move eggplant slices to prepared baking sheet. The Original recipe called for first putting a dab of spaghetti sauce on eggplant ... we felt that made it too soggy, but that's your choice. Top fried eggplant with cheese (we like Provolone) and a sprinkling of Parmesan or Romano. Run under broiler for 2-3 minutes or until cheese has melted into gooey yummy stuff. Oh yeah, baby. Serve hot with a side of pasta, homemade sauce, and a salad. Or eat them dipped in ranch. That'll keep you busy."}, {"Author": ["Litegal1"], "Instructions": "Trim the ends of asparagus and shave off any of the tough skin from lower ends. Slice on the bias into roughly 1\" to 1 1/2\" pieces. Set aside. Saute bacon, set aside to cool, then tear into bitesize pieces. Remove most of grease from pan, leaving a few drippings in for flavor. Begin cooking pasta in another pan according to directions, and then return your attention to saute pan. Saute asparagus pieces in butter and bacon drippings 5 to 6 minutes or until just done. Add shallot and garlic and continue to cook for another minute. Add cream and bacon to pan and let cook several minutes or until it begins to thicken. Add crushed red pepper if desired. Begin slowly adding shredded cheese to sauce until desired flavor is reached (we're usually happy with about 1/4 cup, serving additional on top of pasta). Season well with cracked pepper. Add drained pasta and toss well."}, {"Author": ["Litegal1"], "Instructions": "Combine the ketchup, white vinegar, molasses, honey, liquid smoke, salt, black pepper, paprika, chili powder, cayenne pepper, garlic powder, and onion powder to a medium saucepot set over medium heat; stir to combine. Bring the sauce to a simmer, and then reduce the heat to low to maintain the simmer; cook uncovered for 20 minutes. Add desired amount of Chipolte sauce, then cook an additional 5 to 10 minutes. To make wings: Add the oil to a heavy-bottomed Dutch oven or electric deep fryer, leaving at least 2 inches of space at the top. Heat the oil to 375°F. Dust wings with a light coating of flour (I used flour with a little cayenne pepper, salt & pepper). Fry the wings for 10 to 15 minutes or until they are crisp on the outside. Place on a paper-towel-lined plate to drain off excess oil (and cool slightly) before tossing them in the honey-barbecue sauce. ***NOTE*** we also bake ours in a 400 degree oven for 10 to 15 minutes PRIOR to saucing ... just to make sure they're thoroughly cooked. Nobody wants an undercooked wing. Toss wings in honey-barbecue sauce, and serve immediately"}, {"Author": ["Litegal1"], "Instructions": "Put sugar, yeast, and 3 or 4 T of the warm water aside to bloom. Add all other ingredients to mixing bowl (except cornmeal) and mix. Add yeast mixture and, using dough hook, mix 5 to 10 minutes. Turn dough out, kneed a few times, then place in a greased bowl to rise (1 to 1 1/2 hours). Gently turn out dough (try not to deflate too much) and roll out to 1/2\" thick. Cut with 3 1/2\" cutter (I used chicken can to shape and then cut with pastry knife). Place on UNGREASED cookie sheet that has been liberally dusted with cornmeal. Sprinkle additional cornmeal all over top. Cover with wax paper and set aside to rise again (45 minutes or so). Heat griddle to 325 and sprinkle liberally with cornmeal. Gently transfer muffins to griddle and bake 10 minutes each side. You might want to preheat oven to 350 while griddling ... can throw them in the oven to tighten up a bit if they've risen high and you're having difficulty getting internal temp to 190. I only ha d to bake 3 or 4 of them for around 4 minutes or so."}, {"Author": ["LoveMexiFood"], "Instructions": "Heat oven to 350 degrees. In hot oil fry corn tortillas for 20 seconds. Drain & wipe excessive oil. Cook and drain ground meat. Mix soups and milk. In 13 X 9\" pan, spray pan with cooking spray. Layer 6 corn tortillas flat in the pan. Layer the meat, soup mixture, 1 cup cheese, 6 corn tortillas, 3 cups cheese, black olives and green onions. Bake approx 20 minutes until the cheese is melted."}, {"Author": ["LoveMexiFood"], "Instructions": "Mix Coconut, vanilla, milk. Fold in egg white. Drop batter from tsp. Onto greased cookie sheet about 2” apart. Bake at 350 degrees 8-10 minutes. Once cooled dip in melted microwaved chocolate."}, {"Author": ["LoveMexiFood"], "Instructions": "Place Roast in crock pot. Add garlic, salt, pepper and 1 can of Red Chili Sauce. Cook on low for 7 to 8 hours. Remove meat, cool enough so that you can remove fat and shred meat. Pour half of the liquid from the crock pot into a bowl, set aside. Be sure to remove any remaining fat from the Crock Pot. Put shredded meat in the crock pot. Stir in the 2nd can of Red Chili Sauce over the meat. Mix in any needed remaining sauce to get the proper consistency. Cook on low in the crock pot for ½ hour or more until thoroughly heated."}, {"Author": ["LoveMexiFood"], "Instructions": "Thinly slice alligator (1/4 inch thick and 4 inches long). Remove all white fatty tissue. Place alligator slices in glass bowl and cover with vinegar or lemon juice, salt, and red pepper. Soak ½ hour (no more). Roll slices in corn meal and flour seasoned with red pepper. Fry in hot grease in iron pot or deep fat fryer until golden brown (about 5 minutes). Eat while warm."}, {"Author": ["LoveMexiFood"], "Instructions": "In a large punch bowl empty Sherbert into the bowl. Pour Soda on top. Serve promptly."}, {"Author": ["LoveMexiFood"], "Instructions": "Mix and put in Freezer canister of Ice cream maker. Follow Directions."}, {"Author": ["LoveMexiFood"], "Instructions": "Combine Raisins and boiling water. Set Aside. Cream Sugar and Butter. Beat Eggs and add to mix. Add applesauce alternately with flour. Add nuts.Last add soda to raisins. Then stir all into cake. Bake at 350 degrees 40 to 45 minutes. Frost with Carmel Frosting when cooled."}, {"Author": ["LoveMexiFood"], "Instructions": "Cook in top of a double boiler for 10 minutes."}, {"Author": ["LoveMexiFood"], "Instructions": "Defrost chicken drums enough to be able to break them apart. Put in Slow Cooker. Pour Italian Dressing over the top and add seasonings. Cook on low for 6 hours. Do not overcook."}, {"Author": ["LoveMexiFood"], "Instructions": "Place roast in a Crock Pot. Add enough water to cover roast (about a quart and a half). Sprinkle salt, pepper, garlic on top of the onions. Cook for 8 hours until tender. Serve with baked potatoes and gravy."}, {"Author": ["LoveMexiFood"], "Instructions": "Put 3 cups of sorted beans in a pan with water and bring to a hard boil for 3 minutes. Drain beans and place in crockpot. Add all other ingredients. Water is approximate and should be 2 to 3 inches away from the top. Cook on High for 4 to 6 hours or Low for 8-10 hours."}, {"Author": ["LoveMexiFood"], "Instructions": "Put roast in crock pot add onion, salt, pepper and 1/2 cup water. Turn on low cook 6-8 hours. Pour off water, shred meat and add remaining ingredients. Cook another hour or so. Use for Burritos or tacos."}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["Johanna WISHES she were a"], "Instructions": "Preheat the oven to 350 degrees. Grease a 1 1/2-quart casserole dish; set aside. Fill a large pan with water. Bring to a boil. Add macaroni; cook 2 to 3 fewer minutes than manufacturer's directions, until outside of pasta is cooked and inside is underdone. Transfer the macaroni to a colander, rinse under cold running water, and drain well. Heat milk in a medium saucepan over medium heat (or in a microwave safe, large measure on 50% power for about 5 minutes, stirring occasionally). Melt butter in a high-sided skillet over medium heat. When butter bubbles, add flour. Cook, stirring, 1 minute. Slowly pour hot milk into flour-butter mixture while whisking. Continue cooking, whisking constantly, until the mixture bubbles and becomes thick. Remove the pan from the heat. Stir in salt, nutmeg, black pepper, cayenne pepper, Dijon mustard, Worcestershire, 2 cups cheddar, and 3/4 cup Gruyere/Havarti. When cheese is incorporated, set cheese sauce aside. Stir macaroni into the reserved cheese sauce. Pour the mixture into the prepared casserole dish. Sprinkle with remaining cheeses. Bake until browned on top, about 20-30 minutes. If desired, broil for a few minutes at the end for more browning. Transfer dish to a wire rack to cool for 5 minutes; serve."}, {"Author": ["Johanna WISHES she were a"], "Instructions": "In a small bowl, beat egg with water. Melt butter in a large skillet over medium low heat. Add egg and leave flat for 1 to 2 minutes. Remove from skillet and cut into shreds. Heat oil in same skillet; add veggies, mushrooms, rice, teriyaki sauce, pepper and chicken. Stir fry together for about 5 minutes, then stir in egg. Serve hot."}, {"Author": ["Johanna WISHES she were a"], "Instructions": "In a bowl, combine cornstarch, sugar, ginger, soy sauce and wine until smooth. Add beef and toss to coat; set aside. In a large skillet, stir-fry bok choy, carrots, zucchini, yellow squash, calabacita, and celery in 1 tablespoon oil for 1 minute. Stir in tomatoes and tofu. Cover and simmer for 4 minutes; remove and keep warm. In the same skillet, stir-fry beef in remaining oil until meat reaches desired doneness. Return vegetables to pan; toss. Serve over rice."}, {"Author": ["Johanna WISHES she were a"], "Instructions": "Preheat oven to 350 degrees F. In a large saucepan over medium heat cover squash with water and cook until tender, about 10 minutes; drain into colander and mash over the sink. To the squash, add eggs, margarine, sugar, seasoned salt and pepper, and 1 cup cornflake crumbs. Mix well and transfer to a 2 quart casserole dish. Sprinkle more conrflake crumbs on top. Bake for 20 to 25 minutes."}, {"Author": ["Johanna WISHES she were a"], "Instructions": "Prepare rice according to package directions. Meanwhile, cook bacon and reserve the drippings. Remove bacon and save for another use. In the bacon drippings, slowly cook onion, celery, mushrooms, and sausage. Stir frequently to keep meat in small pieces; simmer 20 minutes. Drain the grease. Add rice, sherry, and pecans; toss thoroughly. Spray 9x13 casserole dish with non-stick cooking spray and add rice/sausage/pecan mixture. Arrange 8-10 pecan halves on top. Bake uncovered at 350 for 30-35 minutes."}, {"Author": ["Johanna WISHES she were a"], "Instructions": "In a small saucepan over a medium-low heat, whisk (using a metal whisk) together vinegar and cornstarch. Add oil, pineapple juice, ketchup, brown sugar, and salt; whisking constantly until the mixture is heated through."}, {"Author": ["Johanna WISHES she were a"], "Instructions": "In a small saucepan over a medium-low heat, whisk (using a metal whisk) together vinegar and cornstarch. Add oil, pineapple juice, ketchup, and brown sugar; whisking constantly until the mixture is heated through."}, {"Author": ["Johanna WISHES she were a"], "Instructions": "Preheat an oven to 400 degrees F. Place the beef into a mixing bowl, and season with salt, Italian seasoning, oregano, red pepper flakes, hot pepper sauce, and Worcestershire sauce; mix well. Add the milk and cornflake crumbs. Mix until evenly blended, then form into 1 1/2-inch meatballs, and place onto a baking sheet. Bake in the preheated oven until no longer pink in the center, 20 to 25 minutes."}, {"Author": ["Johanna WISHES she were a"], "Instructions": "Preheat oven to 450 degrees F. Spray baking sheet with vegetable cooking spray. Dip fish into flour, then dip in milk. Coat with cornflake crumbs. Place fish on baking sheet. Spray fish with vegetable cooking spray. Bake for 10 minutes, or until fish is done. Serve with lemon juice."}, {"Author": ["Johanna WISHES she were a"], "Instructions": "Preheat oven to 375 degrees. Spread the softened cream cheese evenly into an 8x8-inch baking dish. Pour the chili over the cream cheese, add 4oz chopped green chilies, and sprinkle half the pan with shredded Cheddar cheese (for those who can have dairy). Leave cheese off for dairy-intolerant. Bake in the preheated oven until hot and the cheese is bubbly, about 15 minutes. Serve with sturdy corn chips."}, {"Author": ["ellie"], "Instructions": "combine in a shaker with ice and strain into a martini glass. Garnish with a lime wedge."}, {"Author": ["ellie"], "Instructions": "Combine popcorn kernels and oil in a deep pot over high heat. Cover Listen for popcorn to start popping and carefully shake the pot either on the burner or just above until the popping stops. Wear an oven mitt for protection against burns. Place popped corn into large bowl, you should have about 12 cups. Sprinkle lime jest and salt on popcorn. In a small mixing bowl, stir together melted butter, lime juice and sriracha and toss with popcorn."}, {"Author": ["ellie"], "Instructions": "Combine all ingredients in a heavy saucepan and simmer until thickened. Pour into sterilized jars and seal."}, {"Author": ["ellie"], "Instructions": "Preheat oven to 400°F, Mix chickpeas with oil and spices until evenly coated. Spread chickpeas evenly on a rimmed baking sheet. Bake 30 to 40 minutes or until crispy (shake pan occasionally during the cooking time to ensure an even roast). Serve immediately."}, {"Author": ["ellie"], "Instructions": "Build in an Irish Coffee Glass and top with whipped cream and shaved chocolate."}, {"Author": ["ellie"], "Instructions": "Place all ingredients in a blender and pulse until smooth"}, {"Author": ["ellie"], "Instructions": "Mix all ingredients together and bake in oven at 325 for 15 mins or until warm throughout. Serve right away or chill and reheat later."}, {"Author": ["bellepepper"], "Instructions": "Sort peas, rinse with cold water and add to a large soup pot. Add the chicken broth and water. Cover and bring to a boil. Remove from heat and set aside for one hour. Return the pot to the heat. Add the ham shank, celery, carrots, onion, bay leaf, bouillon granules, pepper and thyme. Cover and gently simmer for about two hours, stirring periodically. Remove and discard the bay leaf. Remove the ham shank, and when cool enough to handle, chop the ham into bite size pieces. Add the ham back to the soup, discarding the bone. Salt to taste, if needed. Heat through and serve."}, {"Author": ["bellepepper"], "Instructions": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil, add pasta, and cook until done; drain. In 8x8 inch baking dish that has been sprayed with non-stick cooking spray, stir together macaroni, shredded Cheddar cheese, cottage cheese, milk, sour cream, Parmesan cheese, salt and pepper. In a small bowl, mix together panko bread crumbs and melted butter. Sprinkle topping over macaroni mixture. Bake covered for 20 minutes and then uncovered for 20 minutes, or until top is golden."}, {"Author": ["bellepepper"], "Instructions": "Preheat oven to 350 degrees F (175 degrees C). Combine cream cheese, mayonnaise and mustard. Add onion, garlic and salt. Fold in peppers and cheeses. Turn into a small baking dish that has been sprayed with vegetable cooking spray. Bake for 25-30 minutes or until bubbly and lightly browned. Serve warm with crackers."}, {"Author": ["bellepepper"], "Instructions": "Heat the oven to 400 degrees. In a small bowl, combine the mayonnaise and Parmesan cheese. Stir in the onions and garlic; set aside. Spray a cookie sheet lightly with non-stick cooking spray, making sure to cover the entire area. Separate the dough into ten biscuits and place on the prepared cookie sheet. Press or roll each biscuit into a 4 inch circle. Spread the cheese mixture on top of each biscuit to within 1/4 inch of the edge, dividing the mixture evenly among all the biscuits. Bake at 400 degrees for 10 to 13 minutes or until golden brown. Serve warm."}, {"Author": ["exception"], "Instructions": ""}, {"Author": ["bellepepper"], "Instructions": "Combine Parmesan cheese, salt, garlic powder, paprika and pepper; set aside. Spray a baking pan (I use a cast iron skillet) with non-stick cooking spray. Then drizzle some vegetable oil into the pan, just to lightly coat the entire bottom surface; set aside. Halve the potatoes and blot the cut side with a paper towel to remove moisture. Place in a bowl and lightly drizzle with vegetable oil. Toss until potatoes are all lightly coated with oil. Sprinkle on the Parmesan cheese mixture and toss to distribute. Place the potatoes, cut side down in the prepared baking pan. Bake uncovered at 400 degrees, for 30-40 minutes, turning cut side up half way through baking time, until golden and crispy. Serve with a dollop of sour cream, if desired."}, {"Author": ["bellepepper"], "Instructions": "In a large bowl combine the brown sugar, tomato sauce, dry mustard, Worcestershire sauce, Tabasco sauce, vinegar and salt, set aside. Cook the bacon until crisp, reserving one tablespoon of bacon fat. Drain bacon, cool and crumble, and add to sauce mixture. Saute the onion in the reserved bacon fat until translucent and add to sauce mixture. Rinse and drain all beans except the baked beans. Add all the beans to the sauce mixture and thoroughly combine. Pour beans into a 9x13\" baking dish that has been sprayed with non-stick cooking spray. Bake at 350 degrees for one hour. Allow to rest 10-15 minutes before serving."}, {"Author": ["bellepepper"], "Instructions": "In a large bowl combine all salad ingredients except pecans, almonds and parsley. Combine all dressing ingredients in a blender or food processor and puree until mixture is smooth. When ready to serve add the pecans, almonds and parsley to the salad and toss. Add some of the dressing to lightly coat (you may not need all the dressing). Season with salt and pepper to taste and serve. This salad may be served cold or at room temperature."}, {"Author": ["bellepepper"], "Instructions": "In a saucepan, combine the oil, vinegar, sugar, salt, pepper and garlic powder. Bring to a boil and stir until sugar is dissolved, 2-3 minutes. Remove from the heat and cool to room temperature. In a large bowl combine the black and pinto beans, corn, bell peppers, celery, onion and jalapeno. Pour cooled dressing over mixture and stir until well coated. Cover and allow to sit at room temperature for at least an hour, stirring occasionally. To serve, stir, and using a slotted spoon, transfer to a serving bowl. Serve with tortilla chips. Refrigerate leftovers; bring to room temperature before serving."}, {"Author": ["TheBritishBaker"], "Instructions": "Chop the oranges into small pieces and add these as well as any juice chopping creates, In to the mixing bowl and combine the sugar, oil, egg, orange juice and, bakery emulsion, mix well. Combine dry ingredients; stir into orange juice mixture just until moistened. Fold in chips. Fill greased or paper-lined muffin cups two-thirds full. Combine topping ingredients; sprinkle over cupcakes. Bake at 375 degrees F for 15-20 minutes or until golden brown"}, {"Author": ["TheBritishBaker"], "Instructions": "1. Prepare piecrust and put in a 9 inch pie pan. 2. Heat oven to 375 degrees. 3. In a large bowl, combine all filing ingredients, blend well. 4. Spoon into pastry lined dish. 5. In medium bowl, blend the topping ingredients with a fork until crumbly. Sprinkle over the filling. 6. Bake at 375 degrees for 40 to 45 minutes or until golden brown."}, {"Author": ["TheBritishBaker"], "Instructions": "Mix all the ingredients together. Store in an airtight container."}, {"Author": ["TheBritishBaker"], "Instructions": "Add liquors to cold milk, pour mixture into pudding mix, blend thoroughly, pour into cups, chill in either the fridge or freezer until serving. (If you store for some time in the freezer ~ allow to thaw at room temperature for about 20 minutes before serving, although they are still good frozen like ice cream). Enjoy..."}, {"Author": ["TheBritishBaker"], "Instructions": "Add liquors to cold milk, pour mixture into pudding mix, blend thoroughly, pour into cups, chill in either the fridge or freezer until serving. (If you store for some time in the freezer ~ allow to thaw at room temperature for about 20 minutes before serving, although they are still good frozen like ice cream). Enjoy..."}, {"Author": ["TheBritishBaker"], "Instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a Bundt pan. Combine cake mix, pudding mix, oil, eggs, water, sour cream, and extract. Beat until smooth. Stir in chocolate. Pour batter into prepared pan. Bake for 1 hour. Allow to cool."}, {"Author": ["TheBritishBaker"], "Instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a Bundt pan. Combine cake mix, pudding mix, apple sauce, eggs, water, sour cream, and extract. Beat until smooth. Stir in chocolate chips. Pour batter into prepared pan. Bake for 1 hour. Allow to cool."}]